#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
module.iam.aws_iam_policy.ebs_csi_policy: Refreshing state... [id=arn:aws:iam::522814736852:policy/EBS_CSI_Policy]
module.iam.aws_iam_role.master: Refreshing state... [id=EKS-Master]
module.iam.aws_iam_policy.autoscaler: Refreshing state... [id=arn:aws:iam::522814736852:policy/ed-eks-autoscaler-policy]
module.vpc.aws_vpc.eks_vpc: Refreshing state... [id=vpc-00937da6c0004a654]
module.iam.aws_iam_role.worker: Refreshing state... [id=ed-eks-worker]
module.iam.aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=ed-eks-worker-20250308130601433000000002]
module.iam.aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=ed-eks-worker-20250308130601574500000005]
module.iam.aws_iam_instance_profile.worker: Refreshing state... [id=EKS-worker-nodes-profile]
module.iam.aws_iam_role_policy_attachment.x-ray: Refreshing state... [id=ed-eks-worker-20250308130601606000000008]
module.iam.aws_iam_role_policy_attachment.autoscaler: Refreshing state... [id=ed-eks-worker-20250308130601443100000003]
module.iam.aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=ed-eks-worker-20250308130601451800000004]
module.iam.aws_iam_role_policy_attachment.ebs_csi_policy_attachment: Refreshing state... [id=ed-eks-worker-20250308130601594900000007]
module.iam.aws_iam_role_policy_attachment.s3: Refreshing state... [id=ed-eks-worker-20250308130601588000000006]
module.iam.aws_iam_role_policy_attachment.AmazonSSMManagedInstanceCore: Refreshing state... [id=ed-eks-worker-20250308130601431100000001]
module.iam.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=EKS-Master-2025030813060170120000000a]
module.iam.aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Refreshing state... [id=EKS-Master-20250308130601673300000009]
module.iam.aws_iam_role_policy_attachment.AmazonEKSServicePolicy: Refreshing state... [id=EKS-Master-2025030813060170250000000b]
module.vpc.aws_internet_gateway.eks_internet_gateway: Refreshing state... [id=igw-04a56ce7788eac8a5]
module.security_groups.aws_security_group.eks_nodes_sg: Refreshing state... [id=sg-01e149f9ed0e482e2]
module.security_groups.aws_security_group.eks_cluster_sg: Refreshing state... [id=sg-03970c865f9974ff2]
module.security_groups.aws_security_group_rule.worker_node_egress_internet: Refreshing state... [id=sgrule-1397364317]
module.security_groups.aws_security_group_rule.worker_node_to_worker_node_ingress_coredns_udp: Refreshing state... [id=sgrule-3407992300]
module.security_groups.aws_security_group_rule.eks_cluster_egress_nginx: Refreshing state... [id=sgrule-402199086]
module.security_groups.aws_security_group_rule.eks_cluster_egress_kublet: Refreshing state... [id=sgrule-3375365090]
module.security_groups.aws_security_group_rule.eks_cluster_ingress_nodes: Refreshing state... [id=sgrule-1254872770]
module.vpc.aws_route_table.public_route_table: Refreshing state... [id=rtb-065dc6d8a5434873e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.aws_eks_addon.example["aws-ebs-csi-driver"] will be created
  + resource "aws_eks_addon" "example" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = "v1.38.1-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "eks-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_addon.example["coredns"] will be created
  + resource "aws_eks_addon" "example" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.11.4-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "eks-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_addon.example["kube-proxy"] will be created
  + resource "aws_eks_addon" "example" {
      + addon_name                  = "kube-proxy"
      + addon_version               = "v1.32.0-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "eks-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_addon.example["vpc-cni"] will be created
  + resource "aws_eks_addon" "example" {
      + addon_name                  = "vpc-cni"
      + addon_version               = "v1.19.2-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "eks-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_cluster.eks will be created
  + resource "aws_eks_cluster" "eks" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "eks-cluster"
      + platform_version              = (known after apply)
      + role_arn                      = "arn:aws:iam::522814736852:role/EKS-Master"
      + status                        = (known after apply)
      + tags                          = {
          + "Name" = "eks-cluster"
        }
      + tags_all                      = {
          + "Name" = "eks-cluster"
        }
      + version                       = "1.32"

      + access_config (known after apply)

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = [
              + "sg-03970c865f9974ff2",
            ]
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.eks_nodes will be created
  + resource "aws_eks_node_group" "eks_nodes" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "eks-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + node_group_name        = "my-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::522814736852:role/ed-eks-worker"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name" = "EKS-NodeGroup-eks-cluster"
        }
      + tags_all               = {
          + "Name" = "EKS-NodeGroup-eks-cluster"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 5
          + min_size     = 2
        }

      + update_config (known after apply)
    }

  # module.eks.aws_launch_template.eks_launch_template will be created
  + resource "aws_launch_template" "eks_launch_template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-0de390ef01354cadf"
      + instance_type          = "t2.medium"
      + key_name               = "test"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "eks-launch-template-"
      + tags_all               = (known after apply)
      + user_data              = "IyEvYmluL2Jhc2gKc2V0IC1vIHh0cmFjZQovZXRjL2Vrcy9ib290c3RyYXAuc2ggZWtzLWNsdXN0ZXIK"
      + vpc_security_group_ids = [
          + "sg-01e149f9ed0e482e2",
        ]

      + metadata_options (known after apply)

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "EKS-Node-eks-cluster"
            }
        }
    }

  # module.security_groups.aws_security_group_rule.ingress_allow_access_from_control_plane will be created
  + resource "aws_security_group_rule" "ingress_allow_access_from_control_plane" {
      + description              = "Allow access from control plane to webhook port of AWS load balancer controller"
      + from_port                = 9443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-01e149f9ed0e482e2"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-03970c865f9974ff2"
      + to_port                  = 9443
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.worker_node_ingress_kublet will be created
  + resource "aws_security_group_rule" "worker_node_ingress_kublet" {
      + description              = "Allow control plane to node ingress for kubelet"
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-01e149f9ed0e482e2"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-03970c865f9974ff2"
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.worker_node_ingress_nginx will be created
  + resource "aws_security_group_rule" "worker_node_ingress_nginx" {
      + description              = "Allow control plane to node ingress for nginx"
      + from_port                = 8443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-01e149f9ed0e482e2"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-03970c865f9974ff2"
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.worker_node_ingress_ssh will be created
  + resource "aws_security_group_rule" "worker_node_ingress_ssh" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow SSH access to worker nodes"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-01e149f9ed0e482e2"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.worker_node_to_worker_node_ingress_coredns_tcp will be created
  + resource "aws_security_group_rule" "worker_node_to_worker_node_ingress_coredns_tcp" {
      + description              = "Allow workers nodes to communicate with each other for coredns TCP"
      + from_port                = 53
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-01e149f9ed0e482e2"
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.worker_node_to_worker_node_ingress_ephemeral will be created
  + resource "aws_security_group_rule" "worker_node_to_worker_node_ingress_ephemeral" {
      + description              = "Allow workers nodes to communicate with each other on ephemeral ports"
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-01e149f9ed0e482e2"
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.vpc.aws_route_table_association.public_subnet_az1_route_table_association will be created
  + resource "aws_route_table_association" "public_subnet_az1_route_table_association" {
      + id             = (known after apply)
      + route_table_id = "rtb-065dc6d8a5434873e"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_subnet_az2_route_table_association will be created
  + resource "aws_route_table_association" "public_subnet_az2_route_table_association" {
      + id             = (known after apply)
      + route_table_id = "rtb-065dc6d8a5434873e"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnet_az1 will be created
  + resource "aws_subnet" "public_subnet_az1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                              = "Public Subnet AZ1"
          + "kubernetes.io/cluster/eks-cluster" = "shared"
          + "kubernetes.io/role/elb"            = "1"
        }
      + tags_all                                       = {
          + "Name"                              = "Public Subnet AZ1"
          + "kubernetes.io/cluster/eks-cluster" = "shared"
          + "kubernetes.io/role/elb"            = "1"
        }
      + vpc_id                                         = "vpc-00937da6c0004a654"
    }

  # module.vpc.aws_subnet.public_subnet_az2 will be created
  + resource "aws_subnet" "public_subnet_az2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                              = "Public Subnet AZ2"
          + "kubernetes.io/cluster/eks-cluster" = "shared"
          + "kubernetes.io/role/elb"            = "1"
        }
      + tags_all                                       = {
          + "Name"                              = "Public Subnet AZ2"
          + "kubernetes.io/cluster/eks-cluster" = "shared"
          + "kubernetes.io/role/elb"            = "1"
        }
      + vpc_id                                         = "vpc-00937da6c0004a654"
    }

Plan: 17 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ravisrma, Action: `pull_request`*